---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Events.ExternalDataTypeServerFailureResolutionExecutingEventArgs
source: html/22f43a41-c5f7-5192-8007-8cb437cedee8.htm
---
# ExternalDataTypeServerFailureResolutionExecutingEventArgs Members

When the event is cancellable, may call the Cancel() method to cancel it.